# Module 5 - Hands On 2 - Pandas Data Frames

Step 4: Import pandas by typing the following code in the notebook and run it by pressing shift + enter

In [1]:
import numpy as np
import pandas as pd

Step 5 Type the following code to create a pandas dataframe using an array.

In [2]:
pd.DataFrame([1, 2, 3, 4, 5])

   0
0  1
1  2
2  3
3  4
4  5

Step 6: Type the following code to create a pandas dataframe using an 2d array.

In [3]:
data = [['John', 56], ['Johnny', 21], ['Joe', 54]]
df = pd.DataFrame(data, columns=['Name', 'Age'])
df

     Name  Age
0    John   56
1  Johnny   21
2     Joe   54

Step 7: Type the following code to create a pandas dataframe using a dictionary.

In [4]:
df = pd.DataFrame({'Name' : ['Anthony', 'Jimmy', 'Dave', 'Ricky'], 'Age' : [35, 45, 40, 42]})
df

      Name  Age
0  Anthony   35
1    Jimmy   45
2     Dave   40
3    Ricky   42

Step 8: Type the following code to create a pandas dataframe by importing data from a csv file.

In [5]:
df = pd.read_csv ('sample.csv')
df

     name  age
0  Name#1   11
1  Name#2   12
2  Name#3   13
3  Name#4   14